CMS/app/Http/Controllers/API/APIController.php

        $id = rand(10, 99).time().rand(10, 99);
        $rand = substr(md5(microtime()),rand(0,26),5).rand(10,99);
        $rand = base64_encode($rand);
        DB::table('users')->insert(['name' => $id, 'first_name' => $firstname, 'last_name' => $lastname, 'email' => $email, 'token' => $rand, 'activated'=>1, 'password' => $password, 'avatar' => $photopath, 'created_at'=>date('Y-m-d H:i:s')]);
        $user_profile = DB::table('profiles')->where('user_id',$id)->first();
        if(empty($user_profile)) {
            DB::table('profiles')->insert(['user_id' => $id, 'mynotification' => 1, 'friendnotification' => 1]);
        }else {
            DB::table('profiles')->where('user_id', $id)->update(['mynotification' => 1, 'friendnotification' => 1]);
        }
        $profile = DB::table('profiles')->where('user_id', $id)->select('mynotification', 'friendnotification')->first();
        $userstyles = DB::table('userstyles')->where('user_id', $id)->select('style_id')->get();
---
insert into `users` (`name`, `first_name`, `last_name`, `email`, `token`, `activated`, `password`, `avatar`, `created_at`) values ('u741511796481', 'firstname', 'lastname', 'email@email.com', 'NGI4NzE=', '1', 'y$.wm0ehMPPHWXeF4.MyXcGebWbDrqdfbC5u5FyPBFGHgIyTVLMET8C', 'http://app.dressd.us/img/avatar/avatar_1511796481.png', '2017-11-27 07:28:01')
select * from `profiles` where `user_id` = 'u741511796481' limit 1
insert into `profiles` (`user_id`, `mynotification`, `friendnotification`) values ('u741511796481', '1', '1')
select `mynotification`, `friendnotification` from `profiles` where `user_id` = 'u741511796481' limit 1
select `style_id` from `userstyles` where `user_id` = 'u741511796481'